forgesworn/heartwood-esp32/firmware/sdkconfig.defaults
# Heltec WiFi LoRa 32 V4 — ESP32-S3
CONFIG_IDF_TARGET="esp32s3"

# PSRAM disabled — not needed for signing, avoids mode mismatch
# (Heltec V4 has quad-SPI PSRAM but we don't use external RAM)

# Large stack for k256 elliptic curve operations on Xtensa
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768

# Disable task watchdog — provisioning blocks on stdin indefinitely
CONFIG_ESP_TASK_WDT_INIT=n
